In [1]:
import ibm_db
#Replace the placeholder values with your actual Db2 hostname, username, and password:
dsn_hostname = "dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net" 
dsn_uid = "frj14709"        
dsn_pwd = "b+x7065bk25ckt4d" 
dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "BLUDB"            
dsn_port = "50000"                
dsn_protocol = "TCPIP"         

dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)

#print the connection string to check correct values are specified
# print(dsn)

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

Connected to database:  BLUDB as user:  frj14709 on host:  dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net

In [2]:
import pandas
import ibm_db_dbi
#connection for pandas
pconn = ibm_db_dbi.Connection(conn)
#query statement to retrieve all rows in INSTRUCTOR table
selectQuery = "select * from SPACEXTBL"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

,DATE,TIME__UTC_,BOOSTER_VERSION,LAUNCH_SITE,PAYLOAD,PAYLOAD_MASS__KG_,ORBIT,CUSTOMER,MISSION_OUTCOME,LANDING__OUTCOME
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt
...,...,...,...,...,...,...,...,...,...,...
96,2020-11-05,23:24:23,F9 B5B1062.1,CCAFS SLC-40,"GPS III-04 , Crew-1",4311,MEO,USSF,Success,Success
97,2020-11-16,00:27:00,F9 B5B1061.1,KSC LC-39A,"Crew-1, Sentinel-6 Michael Freilich",12500,LEO (ISS),NASA (CCP),Success,Success
98,2020-11-21,17:17:08,F9 B5B1063.1,VAFB SLC-4E,"Sentinel-6 Michael Freilich, Starlink 15 v1.0",1192,LEO,NASA / NOAA / ESA / EUMETSAT,Success,Success
99,2020-11-25,02:13:00,F9 B5 B1049.7,CCAFS SLC-40,"Starlink 15 v1.0, SpaceX CRS-21",15600,LEO,SpaceX,Success,Success
100,2020-12-06,16:17:08,F9 B5 B1058.4,KSC LC-39A,SpaceX CRS-21,2972,LEO (ISS),NASA (CRS),Success,Success

In [3]:
# Display the names of the unique launch sites in the space mission
selectQuery = "SELECT DISTINCT(LAUNCH_SITE) FROM SPACEXTBL;"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

    LAUNCH_SITE
0   CCAFS LC-40
1  CCAFS SLC-40
2    KSC LC-39A
3   VAFB SLC-4E

In [4]:
# Display 5 records where launch sites begin with the string 'CCA' 
selectQuery = "SELECT * FROM SPACEXTBL where LAUNCH_SITE like 'CCA%' LIMIT 5;"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

,DATE,TIME__UTC_,BOOSTER_VERSION,LAUNCH_SITE,PAYLOAD,PAYLOAD_MASS__KG_,ORBIT,CUSTOMER,MISSION_OUTCOME,LANDING__OUTCOME
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

In [5]:
# Display the total payload mass carried by boosters launched by NASA (CRS)
selectQuery = "SELECT SUM(PAYLOAD_MASS__KG_) FROM SPACEXTBL WHERE CUSTOMER = 'NASA (CRS)';"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

       1
0  45596

In [7]:
# Display average payload mass carried by booster version F9 v1.1
selectQuery = "SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEXTBL WHERE BOOSTER_VERSION = 'F9 v1.1';"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

        1
0  2928.4

In [6]:
# List the date when the first successful landing outcome in ground pad was acheived.
selectQuery = "SELECT MIN (DATE) FROM SPACEXTBL WHERE LANDING__OUTCOME = 'Success (ground pad)';"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

            1
0  2015-12-22

In [7]:
#List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000
selectQuery = "SELECT  BOOSTER_VERSION FROM SPACEXTBL WHERE LANDING__OUTCOME = 'Success (drone ship)' and PAYLOAD_MASS__KG_ > 4000 AND PAYLOAD_MASS__KG_ < 6000;"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

  BOOSTER_VERSION
0     F9 FT B1022
1     F9 FT B1026
2  F9 FT  B1021.2
3  F9 FT  B1031.2

In [8]:
# List the total number of successful and failure mission outcomes

#List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000
selectQuery = "SELECT  COUNT(*) as SUCCSFUL FROM SPACEXTBL WHERE MISSION_OUTCOME  LIKE  '%Success%'"
#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

   SUCCSFUL
0     100.0

In [9]:
# List the total number of successful and failure mission outcomes

selectQuery = "SELECT  COUNT(*) AS FAILURE FROM SPACEXTBL WHERE MISSION_OUTCOME  LIKE  'Fail%';"
#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

   FAILURE
0      1.0

In [10]:
# List the names of the booster_versions which have carried the maximum payload mass. Use a subquery

selectQuery = "SELECT  BOOSTER_VERSION, PAYLOAD_MASS__KG_ FROM SPACEXTBL WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL);"
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

   BOOSTER_VERSION  PAYLOAD_MASS__KG_
0    F9 B5 B1048.4              15600
1    F9 B5 B1049.4              15600
2    F9 B5 B1051.3              15600
3    F9 B5 B1056.4              15600
4    F9 B5 B1048.5              15600
5    F9 B5 B1051.4              15600
6    F9 B5 B1049.5              15600
7    F9 B5 B1060.2              15600
8    F9 B5 B1058.3              15600
9    F9 B5 B1051.6              15600
10   F9 B5 B1060.3              15600
11   F9 B5 B1049.7              15600

In [16]:
# List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015
selectQuery = "SELECT BOOSTER_VERSION, LAUNCH_SITE, LANDING__OUTCOME, YEAR(DATE) AS YR FROM SPACEXTBL WHERE LANDING__OUTCOME = 'Failure (drone ship)' AND YEAR(DATE) = '2015';"
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

  BOOSTER_VERSION  LAUNCH_SITE      LANDING__OUTCOME    YR
0   F9 v1.1 B1012  CCAFS LC-40  Failure (drone ship)  2015
1   F9 v1.1 B1015  CCAFS LC-40  Failure (drone ship)  2015

In [15]:
# Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

selectQuery = "SELECT LANDING__OUTCOME, COUNT(LANDING__OUTCOME)AS LAND_CNT FROM SPACEXTBL WHERE DATE > '2010-06-04' AND DATE < '2017-03-20' GROUP BY(LANDING__OUTCOME) ORDER BY LAND_CNT;" 
pdf = pandas.read_sql(selectQuery, pconn)

#print the entire data frame
pdf

         LANDING__OUTCOME  LAND_CNT
0     Failure (parachute)       1.0
1  Precluded (drone ship)       1.0
2    Uncontrolled (ocean)       2.0
3      Controlled (ocean)       3.0
4    Success (ground pad)       3.0
5    Failure (drone ship)       5.0
6    Success (drone ship)       5.0
7              No attempt      10.0